docs(lib-network-protocol): use mermaid diagram on security readme.md
